panda5mt/USB_CDC_on_PIC32MX220/usbcdc_pic32mx.X/USB_CDC.c
    USBDeviceInit();	//usb_device.c.  Initializes USB module SFRs and firmware
    					//variables to known states.
}//end InitializeSystem



/******************************************************************************
 * Function:        void UserInit(void)
 *
 * PreCondition:    None
 *
 * Input:           None
 *
 * Output:          None
 *
 * Side Effects:    None
 *
 * Overview:        This routine should take care of all of the demo code
 *                  initialization that is required.
 *
 * Note:
 *
 *****************************************************************************/
void UserInit(void)
{
//    //Initialize all of the debouncing variables
//    buttonCount = 0;
//    buttonPressed = FALSE;
//    stringPrinted = TRUE;
//
//    //Initialize all of the LED pins
//	mInitAllLEDs();
//
//    //Initialize the pushbuttons
//    mInitAllSwitches();
}//end UserInit

/********************************************************************
 * Function:        void ProcessIO(void)
 *
 * PreCondition:    None
 *
 * Input:           None
 *
 * Output:          None
 *
 * Side Effects:    None
 *
 * Overview:        This function is a place holder for other user
 *                  routines. It is a mixture of both USB and
 *                  non-USB tasks.
 *
 * Note:            None
 *******************************************************************/
void ProcessIO(void)
{
	BYTE numBytesRead;
	BlinkUSBStatus();
	if((USBDeviceState < CONFIGURED_STATE)||(USBSuspendControl==1)) return;
	if(buttonPressed) {
		if(stringPrinted == FALSE) {
			if(mUSBUSARTIsTxTrfReady()) {
				putrsUSBUSART("Button Pressed -- \r\n");
				stringPrinted = TRUE;
			}
		}
	} else {
		stringPrinted = FALSE;
	}
	if(USBUSARTIsTxTrfReady()) {
		numBytesRead = getsUSBUSART(USB_Out_Buffer,64);
		if(numBytesRead != 0) {
			memcpy(USB_In_Buffer,USB_Out_Buffer,64);
			putUSBUSART(USB_In_Buffer,numBytesRead);
		}
	}
	CDCTxService();
}		//end ProcessIO

/********************************************************************
 * Function:        void BlinkUSBStatus(void)
 *
 * PreCondition:    None
 *
 * Input:           None
 *
 * Output:          None
 *
 * Side Effects:    None
 *
 * Overview:        BlinkUSBStatus turns on and off LEDs
 *                  corresponding to the USB device state.
 *
 * Note:            mLED macros can be found in HardwareProfile.h
 *                  USBDeviceState is declared and updated in
 *                  usb_device.c.
 *******************************************************************/
void BlinkUSBStatus(void)
{
//    static WORD led_count=0;
//
//    if(led_count == 0)led_count = 10000U;
//    led_count--;
//
//    #define mLED_Both_Off()         {mLED_1_Off();mLED_2_Off();}
//    #define mLED_Both_On()          {mLED_1_On();mLED_2_On();}
//    #define mLED_Only_1_On()        {mLED_1_On();mLED_2_Off();}
//    #define mLED_Only_2_On()        {mLED_1_Off();mLED_2_On();}
//
//    if(USBSuspendControl == 1)
//    {
//        if(led_count==0)
//        {
//            mLED_1_Toggle();
//            if(mGetLED_1())
//            {
//                mLED_2_On();
//            }
//            else
//            {
//                mLED_2_Off();
//            }
//        }//end if
//    }
//    else
//    {
//        if(USBDeviceState == DETACHED_STATE)
//        {
//            mLED_Both_Off();
//        }
//        else if(USBDeviceState == ATTACHED_STATE)
//        {
//            mLED_Both_On();
//        }
//        else if(USBDeviceState == POWERED_STATE)
//        {
//            mLED_Only_1_On();
//        }
//        else if(USBDeviceState == DEFAULT_STATE)
//        {
//            mLED_Only_2_On();
//        }
//        else if(USBDeviceState == ADDRESS_STATE)
//        {
//            if(led_count == 0)
//            {
//                mLED_1_Toggle();
//                mLED_2_Off();
//            }//end if
//        }
//        else if(USBDeviceState == CONFIGURED_STATE)
//        {
//            if(led_count==0)
//            {
//                mLED_1_Toggle();
//                if(mGetLED_1())
//                {
//                    mLED_2_Off();
//                }
//                else
//                {
//                    mLED_2_On();
//                }
//            }//end if
//        }//end if(...)
//    }//end if(UCONbits.SUSPND...)

}//end BlinkUSBStatus




// ******************************************************************************************************
// ************** USB Callback Functions ****************************************************************
// ******************************************************************************************************
// The USB firmware stack will call the callback functions USBCBxxx() in response to certain USB related
// events.  For example, if the host PC is powering down, it will stop sending out Start of Frame (SOF)
// packets to your device.  In response to this, all USB devices are supposed to decrease their power
// consumption from the USB Vbus to <2.5mA* each.  The USB module detects this condition (which according
// to the USB specifications is 3+ms of no bus activity/SOF packets) and then calls the USBCBSuspend()
// function.  You should modify these callback functions to take appropriate actions for each of these
// conditions.  For example, in the USBCBSuspend(), you may wish to add code that will decrease power
// consumption from Vbus to <2.5mA (such as by clock switching, turning off LEDs, putting the
// microcontroller to sleep, etc.).  Then, in the USBCBWakeFromSuspend() function, you may then wish to
// add code that undoes the power saving things done in the USBCBSuspend() function.

// The USBCBSendResume() function is special, in that the USB stack will not automatically call this
// function.  This function is meant to be called from the application firmware instead.  See the
// additional comments near the function.

// Note *: The "usb_20.pdf" specs indicate 500uA or 2.5mA, depending upon device classification. However,
// the USB-IF has officially issued an ECN (engineering change notice) changing this to 2.5mA for all
// devices.  Make sure to re-download the latest specifications to get all of the newest ECNs.

